{
  "</tool_call>": 151658,
  "<tool_call>": 151657,
  "<|AUDIO|>": 151646,
  "<|IMAGE|>": 151655,
  "<|VIDEO|>": 151656,
  "<|audio_bos|>": 151647,
  "<|audio_eos|>": 151648,
  "<|box_end|>": 151649,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|vision_bos|>": 151652,
  "<|vision_eos|>": 151653,
  "<|vision_pad|>": 151654
}
