{
  "metadata": {
    "total_size": 22366403936
  },
  "weight_map": {
    "talker.codec_head.weight": "model-00005-of-00005.safetensors",
    "talker.model.embed_tokens.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.0.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.1.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.10.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.11.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.12.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.13.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.14.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.15.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.16.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.17.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.18.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.18.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.18.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.18.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.18.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.19.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.k_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.k_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.o_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.q_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.q_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.v_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.19.self_attn.v_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.2.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.2.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.20.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.k_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.k_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.o_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.q_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.q_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.v_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.20.self_attn.v_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.k_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.k_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.o_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.q_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.q_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.v_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.21.self_attn.v_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.k_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.k_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.o_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.q_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.q_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.v_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.22.self_attn.v_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.k_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.k_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.o_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.q_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.q_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.v_proj.bias": "model-00005-of-00005.safetensors",
    "talker.model.layers.23.self_attn.v_proj.weight": "model-00005-of-00005.safetensors",
    "talker.model.layers.3.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.3.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.4.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.5.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.6.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.7.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.8.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.k_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.q_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.v_proj.bias": "model-00004-of-00005.safetensors",
    "talker.model.layers.9.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "talker.model.norm.weight": "model-00005-of-00005.safetensors",
    "talker.thinker_to_talker_proj.bias": "model-00004-of-00005.safetensors",
    "talker.thinker_to_talker_proj.weight": "model-00004-of-00005.safetensors",
    "thinker.audio_tower.audio_bos_eos_token.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.conv1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.conv1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.conv2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.conv2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.0.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.1.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.10.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.11.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.12.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.13.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.14.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.15.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.16.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.17.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.18.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.19.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.2.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.20.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.21.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.22.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.fc1.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.fc1.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.fc2.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.fc2.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "thinker.audio_tower.layers.23.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
