{
    "architectures": [
        "LlamaForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "eos_token_id": 128009,
    "attention_bias": false,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "head_dim": 128,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "max_position_embeddings": 131072,
    "model_type": "llama",
    "num_attention_heads": 24,
    "num_hidden_layers": 28,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-05,
    "rope_theta": 500000.0,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.45.0",
    "use_cache": true,
    "vocab_size": 128256,
    "max_cache_length": 2048,
    "linear_impl_type": "QNN_LPBQ_w4a16o16_G32"
}
