▁ t
e r
i n
▁ a
e n
o n
▁t h
▁ th
e s
▁ s
▁ d
a t
o r
a n
▁ c
i s
r e
i t
▁t he
▁th e
▁ the
a r
l e
▁ w
▁ p
o u
a l
▁ f
▁ m
e d
▁ o
▁ b
o m
io n
i on
in g
i ng
i c
a s
e l
en t
e nt
▁i n
▁ in
▁ h
n d
e t
▁ l
▁ n
s t
▁t o
▁ to
c h
▁ I
r o
i l
▁o f
▁ of
d e
c t
▁ (
a m
▁ C
▁d e
▁ de
▁ S
▁ u
▁ A
▁ \
▁ e
▁a nd
▁an d
▁ and
▁ T
o l
▁ v
i m
o t
a d
u t
▁ g
e m
u r
i d
▁ *
i g
r a
▁r e
▁ re
▁i s
▁ is
q u
o w
▁ M
es t
e st
▁ y
s e
v e
c e
i e
u n
▁ P
▁ B
a g
u l
▁ =
h e
en d
e nd
od e
o de
te r
t er
me nt
men t
m ent
o s
▁ D
i f
at ion
ati on
atio n
a tion
▁f or
▁fo r
▁ for
▁ r
▁ L
▁y ou
▁yo u
▁ you
▁b e
▁ be
l y
ve r
v er
a b
t e
▁i t
▁ it
▁o n
▁ on
r i
u s
▁ "
▁w h
▁ wh
▁c on
▁co n
▁ con
▁ H
▁s t
▁ st
i r
▁ E
▁ F
c k
▁a n
▁ an
t h
e g
a y
it h
i th
▁ R
is t
i st
an d
a nd
▁t hat
▁th at
▁ that
▁a l
▁ al
▁ $
▁ #
o d
u m
▁ W
h t
co de
cod e
c ode
▁ G
at e
a te
es s
e ss
▁ N
er e
e re
p p
▁a s
▁ as
▁s e
▁ se
▁p ro
▁pr o
▁ pro
▁w ith
▁wit h
▁ with
p e
▁ k
er s
e rs
p t
) ;
l o
▁c om
▁co m
▁ com
am e
a me
▁ `
▁C om
▁Co m
▁ Com
i a
an t
a nt
▁l a
▁ la
▁ {
▁e n
▁ en
ct ion
c tion
▁e x
▁ ex
l d
u b
▁ j
l a
u e
▁ J
ic h
i ch
▁d o
▁ do
▁ O
▁q u
▁ qu
i v
or t
o rt
ar t
a rt
▁u n
▁ un
▁# #
▁ ##
▁t his
▁th is
▁ this
k e
▁h a
▁ ha
▁ -
ou t
o ut
▁T he
▁Th e
▁ The
▁n ot
▁no t
▁ not
▁n e
▁ ne
il l
i ll
▁l e
▁ le
c i
ro m
r om
in e
i ne
/ /
o p
eg in
e gin
▁Com ment
▁Comm ent
▁ Comment
be gin
beg in
b egin
с т
as s
a ss
i z
) .
o g
▁ п
▁o r
▁ or
▁w as
▁wa s
▁ was
▁a t
▁ at
ou r
o ur
▁ i
ai n
a in
▁ K
н а
▁ V
g e
▁s u
▁ su
a p
ag e
a ge
ou ld
oul d
o uld
n e
a v
x t
or e
o re
il e
i le
- -
▁ в
▁b y
▁ by
l i
at h
a th
р а
be r
b er
ac h
a ch
al l
a ll
▁T h
▁ Th
ul t
u lt
▁ }
▁ U
▁u s
▁ us
▁ z
us t
u st
▁h ave
▁ha ve
▁hav e
▁ have
li c
l ic
н и
▁c an
▁ca n
▁ can
t r
co m
c om
) ,
▁I n
▁ In
in d
i nd
el l
e ll
▁f rom
▁fr om
▁fro m
▁ from
о в
t o
▁ [
ab le
abl e
a ble
os t
o st
▁c h
▁ ch
ec t
e ct
ig ht
igh t
in t
i nt
▁ '
▁a re
▁ar e
▁ are
▁i m
▁ im
▁s h
▁ sh
▁ <
▁A n
▁ An
▁ с
at a
a ta
ir e
i re
▁t r
▁ tr
co n
c on
or d
o rd
it y
i ty
ar d
a rd
▁h e
▁ he
▁b ut
▁bu t
▁ but
o c
= "
▁p r
▁ pr
ur e
u re
pe r
p er
ac k
a ck
or k
on g
o ng
an s
a ns
к о
pl e
p le
▁d es
▁de s
▁ des
o k
or m
o rm
we r
w er
a k
p r
as e
a se
▁e l
▁ el
p h
a c
▁u nd
▁un d
▁ und
▁a r
▁ ar
▁i f
▁ if
u d
p s
it e
i te
bl e
b le
н о
fe r
f er
p l
iv e
i ve
an g
a ng
en s
e ns
р о
▁s o
▁ so
s o
as t
a st
( )
sw er
s wer
r u
ie s
i es
▁ :
a u
o v
р е
г о
▁d er
▁de r
▁ der
▁m y
▁ my
▁w e
▁ we
▁m e
▁ me
n t
▁a d
▁ ad
ur n
u rn
▁y our
▁you r
▁yo ur
▁ your
:/ /
: //
ar e
a re
▁a ll
▁al l
▁ all
f f
i o
es tion
est ion
esti on
im e
i me
▁e r
▁ er
la ss
las s
l ass
▁ и
▁wh ich
▁ which
om e
o me
on t
o nt
▁p ar
▁pa r
▁ par
▁m a
▁ ma
▁ Y
" ,
▁ о
f t
ia l
i al
c c
ou nd
oun d
o und
▁l i
▁ li
▁re s
▁r es
▁ res
et h
e th
je ct
j ect
▁a pp
▁ap p
▁ app
▁S t
▁ St
ic e
i ce
▁a m
▁ am
ac t
a ct
▁d el
▁de l
▁ del
g r
at ed
ate d
a ted
ie r
i er
▁a b
▁ ab
▁e t
▁ et
al ly
all y
. .
po rt
por t
p ort
i k
▁p er
▁pe r
▁ per
▁c ont
▁con t
▁co nt
▁ cont
р и
к а
se r
s er
л и
l l
ie w
i ew
ig n
i gn
_ {
pu t
p ut
on e
o ne
un ction
unc tion
unct ion
▁d i
▁ di
ar y
a ry
it ion
iti on
i tion
m a
е н
ge t
g et
▁l o
▁ lo
▁v al
▁va l
▁ val
▁ Q
ra n
r an
▁ д
en ce
enc e
▁w ork
▁wor k
▁ work
▁н а
▁ на
i p
it em
ite m
i tem
yp e
y pe
▁ &
▁h is
▁hi s
▁ his
▁u se
▁us e
▁ use
de r
d er
▁An swer
▁Ans wer
▁ Answer
▁w ill
▁wil l
▁ will
iz e
i ze
т а
lo w
l ow
▁C h
▁ Ch
▁g et
▁ge t
▁ get
id e
i de
ou s
o us
in k
pt ion
p tion
л а
tu rn
t urn
un g
u ng
e c
u g
fo rm
for m
f orm
re s
r es
ht t
h tt
ou g
o ug
л ь
▁n o
▁ no
c l
▁r o
▁ ro
▁o ne
▁on e
▁ one
t t
cr i
c ri
d u
▁u p
▁ up
т о
( "
▁o b
▁ ob
w e
or y
o ry
▁e st
▁es t
▁ est
er y
e ry
ie l
i el
st r
s tr
o b
▁qu e
▁q ue
▁ que
ia n
i an
▁o ut
▁ou t
▁ out
▁p l
▁ pl
▁n ew
▁ne w
▁ new
к и
▁ +
r y
ot h
o th
th er
the r
t her
▁v ar
▁va r
▁ var
▁w ould
▁wo uld
▁s er
▁se r
▁ ser
ter n
te rn
t ern
te xt
tex t
t ext
▁t here
▁th ere
▁the re
▁ther e
▁ there
is h
i sh
ro r
r or
т е
▁s et
▁se t
▁ set
▁ @
▁п о
▁ по
▁t e
▁ te
e x
▁re turn
▁ret urn
▁ return
ai l
a il
▁a ny
▁an y
▁ any
▁I t
▁ It
▁f unction
▁fun ction
▁func tion
▁ function
{ \
' ,
é s
al e
a le
а н
▁w hen
▁wh en
▁whe n
▁ when
i b
▁g o
▁ go
an ce
anc e
▁h ad
▁ha d
▁ had
▁Q u
▁ Qu
▁c omp
▁com p
▁co mp
▁ comp
л е
▁ з
ma th
mat h
m ath
▁h as
▁ha s
▁ has
▁ м
▁p re
▁pr e
▁ pre
en er
ene r
e ner
▁p art
▁par t
▁pa rt
▁ part
el f
▁d ie
▁di e
▁ die
▁l ike
▁li ke
▁lik e
▁ like
ra y
r ay
ir st
irs t
▁d is
▁di s
▁ dis
▁m an
▁ma n
▁ man
ri t
r it
▁t hen
▁th en
▁the n
▁ then
▁c lass
▁cl ass
▁cla ss
▁clas s
▁ class
pr o
p ro
▁p o
▁ po
▁u sing
▁us ing
▁ using
e b
▁c ode
▁co de
▁cod e
▁ code
ow n
o wn
▁s ome
▁so me
▁som e
▁ some
ce s
c es
▁$ \
▁ $\
е р
le ct
l ect
▁a u
▁ au
is ch
isc h
i sch
▁c ol
▁co l
▁ col
▁ –
u p
on s
o ns
▁a dd
▁ad d
▁ add
il d
i ld
is s
i ss
va l
v al
ou nt
oun t
o unt
le s
l es
ve nt
ven t
v ent
▁ Z
I n
ro w
r ow
ea r
e ar
at ions
ation s
ati ons
atio ns
a h
qu e
q ue
ub lic
u blic
an k
▁s p
▁ sp
▁W h
▁ Wh
-- --
--- -
- ---
s k
e w
ag s
a gs
т и
an n
a nn
▁ —
er t
e rt
ac e
a ce
sc h
s ch
▁n eed
▁ne ed
▁ need
▁ à
ie n
i en
ou gh
oug h
o ugh
н е
▁d ef
▁de f
▁ def
i j
er n
e rn
▁w hat
▁wh at
▁ what
▁A r
▁ Ar
w o
m l
< /
▁R e
▁ Re
▁e s
▁ es
▁in st
▁ins t
▁ inst
b o
a z
▁# ##
▁## #
▁ б
er m
e rm
▁A l
▁ Al
le d
l ed
д а
te n
t en
se t
s et
л о
▁c omm
▁com m
▁co mm
▁ comm
s h
в а
▁ /
▁d ata
▁da ta
▁dat a
▁ data
▁/ /
▁ //
] (
▁s tr
▁st r
▁ str
os e
o se
▁U n
▁ Un
ve n
v en
S t
.. .
. ..
▁ С
ys t
y st
▁ «
ic k
i ck
i x
pa r
p ar
▁ у
▁w ant
▁wa nt
n g
ot e
o te
▁g r
▁ gr
▁d u
▁ du
▁ .
un d
u nd
▁on ly
▁ only
▁s a
▁ sa
el y
e ly
ve rs
ver s
v ers
▁e nt
▁en t
▁ ent
) )
( '
▁m od
▁mo d
▁ mod
av a
a va
to n
t on
▁sh ould
▁sho uld
▁ should
em ent
eme nt
emen t
e ment
▁f orm
▁for m
▁fo rm
▁ form
▁al so
▁als o
▁ also
▁s c
▁ sc
in gs
ing s
▁Y ou
▁ You
ó n
▁k n
▁ kn
() ;
( );
▁ |
▁w ere
▁we re
▁wer e
s s
▁Qu estion
▁ Question
is e
i se
▁th ey
▁the y
▁ they
▁D e
▁ De
on d
o nd
▁s ol
▁so l
▁ sol
▁f ol
▁fo l
▁ fol
▁m ore
▁mo re
▁mor e
▁ more
▁h er
▁he r
▁ her
▁ _
▁ é
at ch
ft er
fte r
f ter
▁c re
▁cr e
▁ cre
lo ck
loc k
l ock
tr ing
tri ng
t ring
▁T his
▁Th is
▁ This
z e
ad o
a do
ul l
u ll
ge r
g er
b e
▁o ther
▁ot her
▁ other
▁T ags
▁Tag s
▁Ta gs
▁ Tags
ut ion
uti on
u tion
ic t
i ct
▁h ow
▁ho w
▁ how
▁ x
▁S e
▁ Se
▁c he
▁ch e
▁ che
cri pt
cr ipt
▁j ust
▁ju st
▁ just
▁p os
▁po s
▁ pos
an ge
ang e
if ic
ifi c
i fic
re e
r ee
} }
▁t ime
▁tim e
▁ti me
▁ time
ap p
a pp
н ы
▁f ile
▁fil e
▁fi le
▁ file
ar k
ic al
ica l
i cal
▁f irst
▁fir st
▁ first
▁in t
▁i nt
▁ int
▁ В
▁H e
▁ He
t a
um ent
ume nt
umen t
u ment
or s
o rs
le ment
lem ent
l ement
ra c
r ac
▁a g
▁ ag
▁do es
▁ does
y n
re ad
rea d
r ead
ua l
u al
▁L e
▁ Le
y s
▁e m
▁ em
▁n um
▁nu m
▁ num
ve l
v el
д и
ov er
ove r
o ver
▁d if
▁di f
et hod
eth od
▁I f
▁ If
▁s pe
▁sp e
▁ spe
y m
▁t hem
▁th em
▁the m
▁in to
▁int o
▁ into
▁l es
▁le s
▁ les
▁it s
▁i ts
▁ its
es e
e se
ie ld
iel d
i eld
▁p ublic
▁pub lic
▁pu blic
▁publi c
▁ public
▁ П
▁d en
▁de n
▁ den
yst em
ys tem
o f
▁o ver
▁ov er
▁ over
- >
▁f il
▁fi l
▁ fil
na me
nam e
n ame
in al
ina l
i nal
▁i l
▁ il
am ple
amp le
▁w ay
▁wa y
▁ way
ic a
i ca
в о
ce ss
ces s
c ess
it t
i tt
uc h
u ch
▁w here
▁wh ere
▁whe re
▁ where
м и
or g
o rg
htt ps
http s
▁v o
▁ vo
ie nt
ien t
i ent
ov e
o ve
▁val ue
▁valu e
▁ value
en g
e ng
▁L a
▁ La
^ {
re f
r ef
ie d
i ed
E R
▁s tat
▁st at
▁sta t
▁ stat
fi g
f ig
m e
▁v on
▁vo n
▁ von
▁in ter
▁int er
▁inte r
▁ inter
ro id
r oid
at er
ate r
a ter
▁the ir
▁b et
▁be t
▁ bet
▁e in
▁ ein
} \
" >
▁s ub
▁su b
▁ sub
▁o p
▁ op
▁d on
▁do n
▁ don
t y
▁t ry
▁tr y
▁ try
▁P ro
▁Pr o
▁ Pro
▁t ra
▁tr a
▁ tra
▁s ame
▁sa me
▁sam e
▁ same
e p
▁t wo
▁tw o
▁ two
▁n ame
▁na me
▁nam e
▁ name
ol d
o ld
le t
l et
▁s im
▁si m
▁ sim
s p
▁a v
▁ av
br e
b re
ble m
bl em
b lem
e y
▁c ould
▁co uld
▁cou ld
▁ could
▁c or
▁co r
▁ cor
▁a cc
▁ac c
▁ acc
ay s
a ys
cr e
c re
ur r
u rr
s i
▁con st
▁cons t
▁ const
ue s
u es
} $
V iew
▁a ct
▁ac t
▁ act
▁b o
▁ bo
▁к о
▁ ко
▁s om
▁so m
▁ som
▁ab out
▁ about
la nd
lan d
l and
me r
m er
▁l ist
▁li st
▁ list
ca l
c al
▁im port
▁imp ort
▁ import
co l
c ol
▁n a
▁ na
n a
: :
▁w ho
▁wh o
▁ who
▁e rror
▁er ror
▁err or
▁ error
▁ X
at or
ato r
a tor
ex t
e xt
▁b een
▁be en
é r
▁r un
▁ru n
▁ run
po s
p os
▁c l
▁ cl
* *
▁ К
ul ar
ula r
u lar
au se
aus e
a use
▁re g
▁r eg
▁ reg
▁k now
▁kn ow
▁ know
▁s ee
▁se e
▁ see
▁h im
▁hi m
▁ him
ni ng
n ing
▁з а
▁ за
at es
ate s
a tes
fo re
for e
f ore
ion s
io ns
i ons
▁h el
▁he l
▁ hel
ut e
u te
▁re m
▁r em
▁ rem
▁г о
▁ го
▁M ar
▁Ma r
▁ Mar
р у
vi ce
vic e
v ice
ir ect
ire ct
i rect
ne r
n er
▁u nder
▁un der
▁und er
▁ under
ri b
r ib
h r
ч е
▁A s
▁ As
▁e nd
▁en d
▁ end
em ber
emb er
▁ а
▁a tt
▁at t
▁ att
in a
i na
so n
s on
▁f ollow
▁fol low
▁ follow
▁S ch
▁Sc h
▁ Sch
pe ct
pec t
p ect
▁re l
▁r el
▁ rel
▁S o
▁ So
▁l ook
▁lo ok
▁ look
ab el
abe l
a bel
▁pro blem
▁prob lem
▁proble m
▁probl em
▁ problem
▁v an
▁va n
▁ van
st rong
str ong
c o
po n
p on
c a
ad a
a da
" :
con d
co nd
c ond
am b
a mb
} ,
qu est
que st
ques t
q uest
▁a ut
▁au t
▁ aut
▁res ult
▁ result
▁m ay
▁ma y
▁ may
R e
ht tp
htt p
h ttp
) :
▁A nd
▁An d
▁ And
re d
r ed
▁H ow
▁Ho w
▁ How
p o
ск о
с ко
at t
a tt
ou p
o up
ce d
c ed
▁t ype
▁typ e
▁ty pe
▁ type
▁t han
▁th an
▁ than
▁c ons
▁con s
▁co ns
▁ cons
u f
ц и
▁qu estion
▁quest ion
▁questi on
▁ question
ra ph
rap h
r aph
ig h
i gh
▁ М
▁h tt
▁ htt
in s
i ns
de n
d en
▁d a
▁ da
▁v er
▁ve r
▁ ver
o h
▁= >
▁ =>
ri v
r iv
ud e
u de
▁F or
▁Fo r
▁ For
▁r a
▁ ra
fr ac
fra c
f rac
м а
▁a fter
▁af ter
▁ after
} {
▁m ethod
▁met hod
▁ method
" )
am p
a mp
as h
a sh
▁re c
▁r ec
▁ rec
▁d iffer
▁dif fer
▁diff er
O N
a x
am ent
ame nt
amen t
a ment
our ce
Co n
C on
it s
i ts
Na me
N ame
ma n
m an
▁b ec
▁be c
▁ bec
ch e
c he
▁E n
▁ En
a j
▁g ener
▁ge ner
▁gen er
▁gene r
▁ gener
I N
▁i d
▁ id
ag es
age s
a ges
▁l oc
▁lo c
▁ loc
f o
b r
▁s he
▁sh e
▁ she
Pr o
P ro
▁u na
▁un a
▁ una
▁ к
et a
e ta
lo g
l og
ol og
olo g
o log
▁s ur
▁su r
▁ sur
ar g
a rg
▁- -
▁ --
k t
( \
mi n
m in
▁l ine
▁li ne
▁lin e
▁ line
▁v ari
▁var i
▁va ri
▁ vari
с я
ic s
i cs
н я
ve ry
ver y
v ery
ad d
a dd
▁o bject
▁ob ject
▁obj ect
▁ object
I d
▁B ut
▁Bu t
▁ But
▁c ase
▁cas e
▁ca se
▁ case
▁m ake
▁ma ke
▁mak e
▁ make
▁c al
▁ca l
▁ cal
▁p ass
▁pas s
▁pa ss
▁ pass
с ь
ess ion
ne t
n et
. "
▁ г
ä r
д е
n o
at ing
ati ng
atin g
a ting
at o
a to
li ne
lin e
l ine
в и
▁E x
▁ Ex
▁a ss
▁as s
▁ ass
▁v ers
▁ver s
▁ve rs
▁ vers
л я
▁e d
▁ ed
um n
u mn
ot her
oth er
othe r
o ther
ст а
с та
at ive
ativ e
ati ve
St ring
Str ing
S tring
▁l os
▁lo s
▁ los
w n
▁an swer
▁ans wer
▁ answer
▁l et
▁le t
▁ let
▁p e
▁ pe
en ts
ent s
▁f e
▁ fe
in ce
inc e
n i
id er
ide r
i der
ow s
o ws
▁t est
▁te st
▁ test
▁h ere
▁he re
▁her e
▁ here
ro ll
rol l
r oll
▁c all
▁cal l
▁ca ll
▁ call
ru ct
r uct
▁p ol
▁po l
▁ pol
ai t
a it
▁b ack
▁ba ck
▁ back
h o
E x
re ss
res s
r ess
S T
ri ed
rie d
r ied
da te
dat e
d ate
е т
▁d id
▁di d
▁ did
ti ng
t ing
▁E l
▁ El
▁d em
▁de m
▁ dem
) $
ов а
о ва
ur rent
urr ent
urre nt
la ce
lac e
l ace
rig ht
r ight
re n
r en
п о
▁e ach
▁ each
c y
bl ock
blo ck
b lock
da ta
dat a
d ata
▁ %
▁a c
▁ ac
▁= =
▁ ==
ü r
▁p or
▁po r
▁ por
as k
a sk
ar ch
arc h
am es
ame s
a mes
▁C on
▁Co n
▁ Con
ч а
▁o ff
▁of f
▁ off
▁f ind
▁fin d
▁fi nd
▁ find
con t
co nt
c ont
▁n ow
▁no w
▁ now
wor k
w ork
at ional
ation al
ati onal
atio nal
d d
ci ón
ció n
c ión
▁ А
au lt
a ult
Li st
L ist
▁e xt
▁ex t
▁ ext
ur s
u rs
ak e
a ke
ul e
u le
▁p oint
▁po int
▁poi nt
▁ point
A T
au t
a ut
▁tr ans
▁tra ns
▁tran s
▁ trans
▁c o
▁ co
▁re ad
▁r ead
▁ read
▁u sed
▁us ed
▁use d
▁ used
ск и
с ки
ar i
a ri
L E
et er
ete r
e ter
ou n
o un
ev er
e ver
sel f
s elf
in ed
ine d
i ned
id th
u x
j s
▁s uch
▁su ch
▁suc h
▁ such
▁I s
▁ Is
é e
fu l
f ul
▁d ist
▁di st
▁dis t
▁ dist
▁b u
▁ bu
item ize
Con t
Co nt
C ont
j e
с и
▁p rov
▁pro v
▁pr ov
▁ prov
b b
wa rd
war d
w ard
es ent
ese nt
esen t
e sent
er son
ers on
an ks
ank s
w h
no t
n ot
▁W e
▁ We
k a
ro p
r op
at ur
atu r
al s
a ls
▁b el
▁be l
▁ bel
ö r
f r
▁ex ample
▁exam ple
▁ example
▁in cl
▁inc l
am il
ami l
a mil
▁р а
▁ ра
▁ “
▁s tring
▁st ring
▁str ing
▁stri ng
▁ string
▁th ink
▁thin k
T h
▁t em
▁te m
▁ tem
av e
a ve
▁F ran
▁Fr an
▁Fra n
▁ Fran
▁n umber
▁num ber
▁ number
▁s i
▁ si
im es
ime s
i mes
te m
t em
m y
le r
l er
lo ad
= =
▁h and
▁ha nd
▁han d
▁ hand
z a
▁b ecause
▁bec ause
▁ because
▁s ch
▁sc h
▁ sch
v o
th is
t his
I D
ã o
▁st art
▁star t
▁sta rt
▁ start
▁w ar
▁wa r
▁ war
▁he lp
▁hel p
▁ help
t s
▁c har
▁ch ar
▁cha r
▁ char
▁p h
▁ ph
▁m in
▁mi n
▁ min
ti l
t il
ri te
rit e
r ite
-- ------
---- ----
--- -----
------ --
----- ---
------- -
- -------
el s
e ls
▁m it
▁mi t
▁ mit
ed ia
edi a
e dia
к у
▁S h
▁ Sh
an y
a ny
] ;
▁ Б
iqu e
i que
d a
e f
de x
d ex
▁p rodu
▁pro du
▁pr odu
▁prod u
▁ produ
▁ Н
gr am
gra m
g ram
▁O r
▁ Or
▁g re
▁gr e
▁ gre
qu ote
quot e
le g
l eg
or n
o rn
▁in d
▁i nd
▁ ind
▁p ost
▁po st
▁pos t
▁ post
▁d ep
▁de p
▁ dep
] ,
v i
▁u ser
▁us er
▁use r
▁ user
▁ >
li ck
lic k
l ick
▁v ery
▁ver y
▁ve ry
▁ very
et hing
eth ing
e thing
▁ar ray
▁arr ay
▁ array
▁g u
▁ gu
▁d ur
▁du r
` .
т ь
li cation
lic ation
lica tion
ст и
с ти
e k
ic o
i co
▁d at
▁da t
▁ dat
о р
ht ml
htm l
h tml
ion e
io ne
i one
▁d ifferent
▁differ ent
▁c heck
▁che ck
▁ check
▁f r
▁ fr
▁E r
▁ Er
▁t ext
▁te xt
▁tex t
▁ text
н і
ic ht
ich t
i cht
st ack
sta ck
E N
ra g
r ag
▁e very
▁ev ery
▁ever y
▁ every
A r
▁be fore
▁bef ore
▁ before
al se
als e
▁f in
▁fi n
▁ fin
▁d é
▁th ese
▁the se
▁d et
▁de t
▁ det
V al
ce ption
cept ion
cep tion
▁and roid
▁ android
block quote
▁j e
▁ je
fil e
fi le
f ile
at s
a ts
▁д о
▁ до
ess age
essa ge
▁ag ain
a w
C h
we en
w een
▁ Д
fo r
f or
ci al
cia l
c ial
pl ay
pla y
p lay
pr e
p re
id a
i da
▁P ar
▁Pa r
▁ Par
n y
ra ct
rac t
r act
▁s upp
▁su pp
▁sup p
▁ supp
as ed
ase d
a sed
le ction
lect ion
l ection
▁d ans
▁da ns
▁dan s
ai r
a ir
ro l
r ol
▁t hr
▁th r
Dat a
Da ta
D ata
li ch
lic h
l ich
▁п ро
▁пр о
▁ про
▁l ong
▁lo ng
▁lon g
▁ long
▁se cond
▁sec ond
▁ second
ual ly
u ally
in es
ine s
i nes
▁f ound
▁fo und
▁fou nd
▁ found
eng th
y p
ea d
e ad
▁l og
▁lo g
▁ log
u i
ne w
n ew
▁ Р
g o
au s
a us
od y
o dy
▁s on
▁so n
▁ son
м е
er o
e ro
ve d
v ed
su b
s ub
▁r ight
▁rig ht
▁ right
vi ew
vie w
v iew
▁follow ing
' )
") ;
" );
▁sa id
ж е
ч и
т у
ot t
o tt
с е
ar s
a rs
$ .
g g
▁b r
▁ br
oo l
o ol
yl e
y le
us e
u se
▁s how
▁sh ow
▁sho w
▁ show
le ase
lea se
ci a
c ia
▁d irect
▁di rect
▁dire ct
▁dir ect
▁ direct
do c
d oc
а р
m s
▁g iv
▁gi v
▁ giv
▁e xp
▁ex p
▁ exp
q l
д у
в е
▁B e
▁ Be
Co m
C om
it er
ite r
i ter
R E
m p
me n
m en
▁R o
▁ Ro
M A
▁C ol
▁Co l
▁ Col
is ter
ist er
iste r
i ster
▁w ell
▁we ll
▁wel l
▁ well
▁< /
▁ </
ay out
at ure
atur e
atu re
iv ers
ive rs
iver s
i vers
z y
▁н е
▁ не
▁m et
▁me t
▁ met
un e
u ne
yt h
y th
Ty pe
Typ e
T ype
▁e lement
▁el ement
▁ele ment
▁elem ent
▁ element
▁l ink
▁lin k
▁ link
mo d
m od
▁bet ween
▁ between
ce pt
cep t
qu ire
qui re
▁th rough
▁thr ough
▁thro ugh
▁ through
▁wh ile
▁ while
▁O n
▁ On
th e
t he
í a
▁s omething
▁some thing
▁som ething
▁somet hing
▁ something
vo l
v ol
▁m ost
▁mo st
▁mos t
▁ most
s c
us s
u ss
▁c ar
▁ca r
▁ car
▁s m
▁ sm
▁р о
▁ ро
an o
a no
le ft
lef t
l eft
v a
▁tr ue
▁ true
( $
em s
e ms
▁m uch
▁mu ch
á s
▁N ew
▁Ne w
▁ New
▁pro per
▁pr oper
▁prop er
er a
e ra
it ed
ite d
i ted
▁d oc
▁do c
▁ doc
ic es
ice s
i ces
Th e
T he
▁ ?
ст о
с то
f l
▁s pec
▁sp ec
▁spe c
▁ spec
en der
end er
ende r
e nder
wa y
w ay
▁s elf
▁sel f
▁ self
▁e ven
▁ev en
▁ even
і в
▁с е
▁ се
ни я
▁P r
▁ Pr
▁k e
▁ ke
em b
e mb
▁t able
▁tab le
▁ta ble
▁ table
▁e qu
▁eq u
▁ equ
li ent
lie nt
l ient
t d
par t
pa rt
p art
▁pr int
▁pri nt
▁prin t
▁ print
▁u ne
▁un e
▁ une
if y
▁- >
▁ ->
en e
e ne
▁m on
▁mo n
▁ mon
▁d ec
▁de c
▁ dec
▁st ill
▁о б
▁ об
▁T r
▁ Tr
▁ ф
if e
i fe
is m
i sm
b y
ra w
r aw
io r
i or
▁m ed
▁me d
▁ med
or ld
▁com ple
▁comp le
▁compl e
▁ comple
w w
▁a rt
▁ar t
▁ art
ro n
r on
▁ Г
▁M y
▁ My
▁a ls
▁al s
▁ als
re ct
rec t
r ect
▁a uf
▁au f
▁ auf
▁d own
▁do wn
▁dow n
▁ down
at her
ath er
a ther
Co l
C ol
Te xt
Tex t
T ext
ba ck
b ack
$ ,
▁y ear
▁ye ar
▁ year
м о
p i
▁G r
▁ Gr
re am
rea m
▁re p
▁r ep
▁ rep
b f
ww w
w ww
▁w ur
▁o rg
▁or g
▁ org
in ter
int er
inte r
▁D ie
▁Di e
▁ Die
▁b eing
▁be ing
▁bei ng
" .
la bel
lab el
l abel
▁c ent
▁ce nt
▁ cent
ja va
jav a
j ava
ba r
b ar
an te
ant e
an a
a na
_ _
▁sol ution
▁ О
▁f l
▁ fl
▁c reate
▁cre ate
▁ create
ic i
i ci
st e
s te
yth on
yt hon
un t
u nt
as on
aso n
a son
fer ence
fe rence
S E
▁n on
▁no n
▁ non
an e
a ne
▁in s
▁i ns
▁ ins
ad er
ade r
a der
_{ \
_ {\
Re s
R es
▁m ain
▁ma in
▁mai n
▁ main
п и
▁T here
▁The re
▁Th ere
▁Ther e
▁ There
▁p our
▁po ur
▁pou r
R O
` ,
li sh
lis h
l ish
b ject
cc ess
c cess
▁o rig
▁or ig
▁ orig
is chen
isch en
ische n
isc hen
i schen
ow er
owe r
o wer
▁h et
▁he t
▁ het
u c
▁el se
▁els e
▁ else
» .
▁о т
▁ от
eq u
e qu
si ble
s ible
te st
tes t
t est
st and
sta nd
stan d
é n
et s
e ts
G E
id ent
ide nt
iden t
i dent
▁ е
▁п ри
▁пр и
▁ при
. ,
▁d as
▁da s
▁ das
oc k
o ck
, "
▁v ol
▁vo l
▁ vol
▁f o
▁ fo
▁p ara
▁par a
▁pa ra
▁ para
▁ Т
▁C ar
▁Ca r
▁ Car
ra l
r al
▁S p
▁ Sp
va r
v ar
▁p lay
▁pl ay
▁pla y
▁ play
ou se
ous e
o use
▁т а
▁ та
ic ally
ical ly
▁con tain
▁cont ain
pon se
▁S tring
▁St ring
▁Str ing
▁ String
á n
▁b oth
▁bo th
▁bot h
▁ both
ke n
k en
A R
ер е
е ре
▁I l
▁ Il
▁is s
▁i ss
▁ iss
▁o pen
▁op en
▁ open
▁ )
▁W hat
▁Wh at
▁ What
f e
riv ate
re g
r eg
▁with out
▁ without
▁z u
▁ zu
vi s
v is
fl ow
f low
▁h ttp
▁htt p
▁ http
ab ase
aba se
a base
▁w ord
▁wor d
▁wo rd
▁ word
▁ch ange
▁chang e
▁ change
▁work s
▁wor ks
▁ works
▁g e
▁ ge
▁ !
▁e en
▁ een
it le
▁e vent
▁even t
▁ev ent
▁ event
wo rd
wor d
w ord
an do
and o
S B
re m
r em
▁f ield
▁fi eld
▁fiel d
▁ field
vi ng
vin g
v ing
Se r
S er
▁o ur
▁ou r
▁ our
▁qu i
▁q ui
▁ qui
▁o per
▁op er
▁ oper
▁is t
▁i st
▁ ist
de f
d ef
▁m ade
▁ma de
▁mad e
▁ made
ни е
p x
▁m en
▁me n
▁ men
r m
ai s
a is
ce nt
cen t
c ent
li st
lis t
l ist
T o
▁T o
▁ To
j a
ve rt
ver t
v ert
▁m ar
▁ma r
▁ mar
val ue
valu e
▁ „
" ;
▁a us
▁au s
▁ aus
▁B r
▁ Br
ol e
o le
▁m ult
▁mu lt
▁mul t
▁ mult
oug ht
ough t
▁m at
▁ma t
▁ mat
▁v iew
▁vi ew
▁vie w
▁ view
fi l
f il
▁с о
▁ со
г а
▁v oid
▁vo id
▁ void
▁g ood
▁go od
▁ good
б о
C T
▁m any
▁ma ny
▁man y
▁ many
be n
b en
▁в о
▁ во
▁к а
▁ ка
▁s ystem
▁sys tem
▁syst em
▁ system
in o
i no
▁an other
▁ano ther
▁ another
▁re st
▁r est
▁res t
▁ rest
us er
use r
u ser
il ity
ili ty
a i
▁m ight
▁mig ht
us tom
ust om
usto m
▁or der
▁ord er
▁ order
▁V er
▁Ve r
▁ Ver
S S
} )
▁e ff
▁ eff
д о
et t
e tt
▁s ign
▁si gn
▁sig n
▁ sign
м у
I T
st ring
str ing
s tring
el le
ell e
e lle
▁s ing
▁si ng
▁sin g
▁ sing
cu l
c ul
▁tr ying
▁try ing
▁b eg
▁be g
▁ beg
▁p age
▁pa ge
▁pag e
▁ page
х о
▁C an
▁Ca n
▁ Can
▁S er
▁Se r
▁ Ser
+ +
▁m ust
▁mus t
▁mu st
▁ must
▁val ues
▁value s
▁valu es
▁ values
▁k ey
▁ke y
▁ key
ib le
i ble
] .
ir d
i rd
▁pro gram
▁pr ogram
▁ program
roll er
rol ler
rolle r
▁c onne
▁con ne
▁conn e
▁ conne
▁s ay
▁sa y
▁ say
▁p aram
▁par am
▁para m
▁pa ram
▁ param
ach e
ac he
a che
ve lop
vel op
▁s elect
▁se lect
▁sel ect
▁sele ct
▁ select
▁f amil
▁fa mil
▁fam il
▁ famil
▁l ast
▁la st
▁las t
▁ last
▁Th anks
▁Thank s
▁ Thanks
▁p op
▁po p
▁ pop
} .
e q
▁does n
[ '
▁t erm
▁te rm
▁ter m
▁ term
▁r é
▁ ré
▁d ocument
▁doc ument
▁ document
п а
л у
at eg
ate g
. )
li ng
lin g
l ing
ion al
io nal
iona l
i onal
ab les
able s
abl es
a bles
▁t ak
▁ta k
ut ton
utt on
utto n
▁a rg
▁ar g
▁ arg
ty pe
typ e
t ype
▁s ure
▁su re
▁sur e
▁re al
▁ real
▁w eb
▁we b
▁ web
▁c urrent
▁cur rent
▁curr ent
▁ current
▁P l
▁ Pl
ch o
c ho
ment s
men ts
m ents
▁J oh
▁Jo h
ot s
o ts
▁ex ist
▁ exist
н у
▁f ür
▁ für
▁и з
▁ из
d o
но го
ног о
н ого
▁l as
▁la s
▁ las
▁n ull
▁nu ll
▁ null
▁in form
▁inf orm
▁info rm
▁ Л
▁v ersion
▁vers ion
▁ version
▁c hang
▁ch ang
▁cha ng
ag er
age r
a ger
▁C omm
▁Com m
▁Co mm
▁ Comm
л і
us h
u sh
▁G e
▁ Ge
▁h igh
▁hi gh
▁ high
▁in put
▁ input
og le
o gle
ro s
r os
bo x
b ox
ge n
g en
▁s te
▁st e
▁ ste
▁l ocal
▁lo cal
▁loc al
▁ local
I m
▁pro cess
▁proc ess
▁proces s
▁ process
ter nal
tern al
t ernal
iz ed
ize d
i zed
г и
é t
▁I nd
▁In d
▁ Ind
▁o ch
▁oc h
▁ och
l t
▁col umn
▁ column
▁t ried
▁tr ied
▁tri ed
▁comm and
▁comma nd
▁ command
▁b est
▁be st
▁bes t
▁ best
as ter
ast er
aste r
a ster
з а
▁p rim
▁pr im
▁pri m
▁ prim
▁m odel
▁mod el
▁mo del
▁mode l
▁ model
▁ і
▁th ose
it ies
iti es
itie s
i ties
è re
▁р е
▁ ре
ј е
ш и
qu es
que s
q ues
▁A m
▁ Am
▁o wn
▁ow n
▁ own
li n
l in
з и
Val ue
th ing
t hing
▁ ,
▁T e
▁ Te
▁st ud
▁ stud
▁u m
▁ um
▁ser ver
▁serv er
▁serve r
▁ server
il le
ill e
i lle
▁p ut
▁pu t
▁ put
at iv
ati v
g y
ов и
о ви
ra f
r af
ов о
о во
▁wur de
▁W hen
▁Wh en
▁Whe n
▁ When
▁d iv
▁di v
▁ div
an ts
ant s
▁t er
▁te r
▁ ter
▁part ic
▁parti c
▁ т
▁D o
▁ Do
▁N o
▁ No
se rt
ser t
s ert
id o
i do
math cal
ad e
a de
▁I I
▁ II
le ar
lea r
l ear
og raph
o graph
en se
ens e
▁r ow
▁ro w
▁ row
nu m
n um
▁pos sible
▁poss ible
▁possib le
▁ possible
▁s ince
▁sin ce
▁ since
▁B o
▁ Bo
ct ions
ction s
▁I m
▁ Im
O R
ц і
▁i de
▁id e
▁ ide
ma p
m ap
▁cor rect
▁corre ct
▁corr ect
▁ correct
ve s
v es
ph p
p hp
▁out put
▁ output
▁P h
▁ Ph
A L
ar ed
are d
a red
\ \
▁im age
▁imag e
▁ image
es ch
esc h
e sch
ж и
▁con f
▁ conf
po r
p or
qu ery
que ry
quer y
ur es
ure s
u res
iu m
i um
en ds
end s
▁A b
▁ Ab
SB N
і д
et her
eth er
ethe r
e ther
pt ions
ption s
it u
i tu
li b
l ib
n s
k i
▁work ing
▁wor king
▁ working
▁c omo
▁com o
▁co mo
▁ como
▁T hen
▁The n
▁Th en
▁ Then
M L
ke y
k ey
cl ass
cla ss
c lass
op le
o ple
itt le
▁m atch
▁mat ch
▁ match
way s
wa ys
w ays
math bb
▁re quire
▁requ ire
▁ require
al t
a lt
▁v is
▁vi s
▁ vis
▁b l
▁ bl
▁c alled
▁cal led
▁call ed
▁ called
It em
I tem
ur a
u ra
ve c
v ec
em e
e me
▁d ella
▁de lla
▁del la
▁dell a
em bre
emb re
ur g
u rg
S e
▁re quest
▁requ est
▁req uest
▁ request
is che
isch e
isc he
i sche
▁p ort
▁po rt
▁por t
▁ port
▁inst ead
= \
▁ У
ho r
h or
en te
ent e
um e
u me
er d
e rd
с а
▁w hy
▁wh y
▁ why
ri st
ris t
r ist
▁p erson
▁per son
▁pers on
▁ person
▁. ..
▁.. .
▁ ...
▁p rivate
▁priv ate
▁ private
▁t ot
▁to t
▁ tot
ph a
p ha
if t
i ft
it a
i ta
lo c
l oc
▁o ld
▁ol d
▁ old
о н
▁n el
▁ne l
▁ nel
' ]
t i
ie t
i et
ci te
cit e
c ite
ple ment
pl ement
p lement
▁a bove
▁ab ove
▁ above
k s
re ady
read y
rea dy
▁c ome
▁com e
▁co me
▁ come
se ction
sec tion
sect ion
s ection
▁P ol
▁Po l
▁ Pol
▁w rit
▁wr it
▁ writ
▁htt ps
▁http s
▁ https
▁$ $
▁ $$
▁ »
▁bu ild
▁ build
it o
i to
▁cons ider
▁consid er
af t
a ft
Ap p
A pp
, \
ind ows
indow s
indo ws
com m
co mm
c omm
▁ ;
gr ound
gro und
g round
▁p lace
▁pl ace
▁pla ce
▁ place
B y
▁pro ject
▁ project
Ob ject
Obj ect
O bject
▁re pr
▁rep r
en ces
ence s
enc es
ind ow
indo w
z t
▁f iles
▁file s
▁fil es
▁fi les
▁ files
c z
iv ity
ivi ty
i vity
▁in it
▁i nit
▁ init
▁p rob
▁pro b
▁pr ob
▁ prob
▁s k
▁ sk
or th
ort h
im ent
ime nt
imen t
i ment
ou ble
at al
ata l
a tal
ir c
i rc
▁ è
▁b re
▁br e
▁ bre
is ta
ist a
i sta
in put
▁ И
но й
su m
s um
pa th
pat h
p ath
▁c our
▁co ur
▁cou r
▁t oo
▁to o
▁A d
▁ Ad
▁G u
▁ Gu
▁f alse
▁fal se
▁ false
▁f un
▁fu n
▁ fun
▁с т
▁ ст
oo d
o od
è s
▁e nc
▁en c
▁ enc
bo l
b ol
r l
ar get
arg et
or der
ord er
orde r
▁me an
▁ mean
п е
ig en
ige n
i gen
▁п ре
▁пр е
▁ пре
wid th
w idth
; 
it or
ito r
i tor
▁st ate
▁stat e
▁sta te
▁ state
▁gre at
en n
e nn
bi n
b in
E r
Mo d
M od
o z
▁w on
▁wo n
▁ won
▁f act
▁fa ct
▁fac t
▁ fact
▁j ava
▁ja va
▁jav a
▁ java
▁Un ivers
▁ Univers
▁c ap
▁ca p
▁ cap
is tor
ist or
isto r
i stor
} (
k u
it her
ith er
i ther
al es
ale s
a les
▁o u
▁ ou
ro ss
ros s
r oss
▁t ake
▁tak e
▁ta ke
▁ take
ri x
r ix
lo b
l ob
▁e ine
▁ein e
as es
ase s
▁a ccess
▁acc ess
▁ac cess
▁ access
it é
i té
is tr
ist r
i str
iz ation
iza tion
▁app ro
▁ap pro
▁ appro
ba ll
bal l
b all
▁m ak
▁ma k
} ^
▁C ons
▁Con s
▁Co ns
▁ Cons
pr ess
pre ss
pres s
p ress
se rv
ser v
s erv
() .
( ).
a f
▁re f
▁r ef
▁ ref
) \
▁cont in
s u
iv er
ive r
i ver
▁c ond
▁con d
▁co nd
▁ cond
▁ex pect
▁exp ect
▁ expect
▁char act
▁cha ract
ber t
be rt
b ert
el t
e lt
ter s
te rs
t ers
scri pt
scr ipt
s cript
▁E d
▁ Ed
ap t
a pt
') ;
' );
pr int
▁s ize
▁si ze
▁ size
▁s ich
▁si ch
▁sic h
fa ce
fac e
f ace
en den
end en
ende n
▁A mer
▁Am er
▁ Amer
if ied
ifi ed
ifie d
ó w
▁S u
▁ Su
te s
t es
me d
m ed
▁R eg
▁Re g
▁ Reg
so le
sol e
s ole
▁in clud
▁incl ud
▁inclu d
▁ includ
in i
i ni
in ci
inc i
▁p la
▁pl a
▁ pla
▁l eft
▁le ft
▁ left
d f
Pa r
P ar
▁A ll
▁Al l
▁ All
▁o cc
▁oc c
▁ occ
▁A t
▁ At
▁c r
▁ cr
Q u
▁g iven
▁giv en
▁give n
▁gi ven
▁S ystem
▁Syst em
▁ System
ic an
ica n
i can
▁f inal
▁fin al
▁fi nal
▁ final
it ions
ition s
iti ons
▁б ы
▁ бы
▁per form
▁perf orm
▁ perform
A N
▁M e
▁ Me
ur o
u ro
▁T hat
▁Th at
▁ That
г ра
▁П о
▁ По
▁в и
▁ ви
ab ly
abl y
▁pr esent
▁pre sent
▁pres ent
▁ present
du ct
d uct
ri c
r ic
▁E ng
▁En g
▁ Eng
tr y
t ry
▁l ar
▁la r
▁ lar
b l
id d
i dd
▁ä r
▁ är
or a
o ra
L L
os s
o ss
▁I SBN
▁ ISBN
▁th ree
▁thr ee
▁thre e
▁ three
j o
n í
r c
▁f ar
▁fa r
▁ far
▁N ot
▁No t
▁ Not
▁l ittle
▁litt le
di s
d is
at i
a ti
fun ction
func tion
f unction
▁a ble
▁ab le
▁ able
le ss
les s
l ess
с о
▁p ath
▁pat h
▁pa th
▁ path
▁p res
▁pr es
▁pre s
▁ pres
lo se
los e
l ose
P I
▁iss ue
▁issu e
▁ issue
ack age
ti me
tim e
t ime
ig e
i ge
am s
a ms
▁C l
▁ Cl
ail s
ai ls
a ils
al k
i i
ш е
pe n
p en
Q L
▁e as
R L
ce l
c el
▁s l
▁ sl
▁a sk
▁as k
▁ ask
▁n om
▁no m
▁ nom
▁t op
▁to p
▁ top
id es
ide s
i des
in dex
ind ex
inde x
é m
▁h app
▁ha pp
o x
c d
▁b etter
▁bet ter
▁lo ad
▁ load
ad os
ado s
ze n
z en
▁c e
▁ ce
▁f a
▁ fa
▁J ohn
▁Joh n
▁Jo hn
▁ John
IM A
I MA
▁B ar
▁Ba r
▁ Bar
over flow
▁д е
▁ де
ne ss
nes s
n ess
ce r
c er
▁H ere
▁He re
▁Her e
▁ Here
re t
r et
▁s z
▁ sz
amb da
op y
o py
ur l
u rl
p y
r t
▁under stand
a ł
he r
h er
# #
▁ch ild
▁chi ld
▁ child
▁ex ec
▁ exec
▁app lication
▁applic ation
▁ application
▁st ruct
▁str uct
▁stru ct
▁ struct
▁ я
Fil e
Fi le
F ile
▁c ert
▁ce rt
▁cer t
▁ cert
is on
iso n
i son
▁vari able
▁ variable
D E
r s
▁re ally
▁real ly
Po rt
P ort
b a
▁B er
▁Be r
▁ Ber
▁in te
▁int e
▁ inte
▁st atic
▁stat ic
▁stati c
▁ static
▁con fig
▁conf ig
▁ config
▁S he
▁Sh e
▁ She
est ions
estion s
esti ons
▁p lus
▁pl us
▁ plus
▁h ab
▁ha b
▁ hab
op e
o pe
▁m us
▁mu s
▁ mus
▁c ount
▁co unt
▁coun t
▁cou nt
▁ count
M E
▁su pport
▁supp ort
▁sup port
▁ support
▁pe ople
▁ people
▁b eh
▁be h
▁al ready
T r
▁d one
▁do ne
▁don e
▁ done
de m
d em
si ze
s ize
al pha
alph a
▁d isc
▁di sc
▁dis c
] )
▁M an
▁Ma n
▁ Man
▁m il
▁mi l
▁ mil
▁st and
▁sta nd
▁stan d
▁ stand
▁gr oup
▁gro up
▁ group
▁sm all
▁ small
▁m ag
▁ma g
▁ mag
ст ь
с ть
▁de fault
▁def ault
▁ default
▁sing le
▁sin gle
▁ single
lin k
l ink
cl ude
clud e
▁e ar
▁ ear
il ar
ila r
i lar
** **
*** *
* ***
▁f ix
▁fi x
▁ fix
le y
l ey
▁p as
▁pa s
▁ pas
ни й
iss ion
▁im plement
▁imp lement
▁impl ement
it ch
▁го да
▁год а
▁al ways
▁ always
▁J ah
▁Ja h
pr ing
p ring
ç ão
pl ate
pla te
p late
▁de scri
▁des cri
▁desc ri
▁h ead
▁he ad
▁ head
in it
ini t
i nit
og raf
▁qu ery
▁que ry
▁quer y
▁ query
iv ed
ive d
i ved
▁in g
▁i ng
▁ ing
pt y
p ty
h a
▁m ov
▁mo v
▁ mov
▁ э
et te
ett e
e tte
il y
i ly
▁g ot
▁go t
▁ got
il ed
ile d
i led
ic ro
i cro
▁w r
▁ wr
р я
▁n ever
▁ne ver
▁nev er
or es
ore s
o res
▁b as
▁ba s
▁ bas
io s
i os
la ck
lac k
l ack
ain t
ai nt
a int
vi ous
v ious
▁g ive
▁giv e
▁gi ve
id ad
ida d
E n
ны й
н ый
ta ble
tab le
t able
▁Н а
▁ На
▁p at
▁pa t
▁ pat
то р
т ор
an gu
ang u
lo y
l oy
▁s eg
▁se g
▁ seg
ar ray
arr ay
▁F l
▁ Fl
▁in dex
▁ind ex
▁inde x
▁ index
▁s w
▁ sw
IMA GE
IM AGE
▁k m
▁ km
б и
Cl ass
Cla ss
C lass
en a
e na
ме н
м ен
com p
co mp
c omp
at us
atu s
ra p
r ap
▁L ist
▁Li st
▁Lis t
▁ List
Er ror
Err or
E rror
▁t yp
▁ty p
▁ typ
▁м а
▁ ма
c s
' :
j i
▁How ever
▁ However
▁т е
▁ те
▁be low
▁bel ow
▁ below
▁A pp
▁Ap p
▁ App
щ е
} _
bu m
b um
vi r
v ir
ée s
é es
▁re cord
▁rec ord
▁ record
ta in
t ain
le m
l em
it al
ita l
i tal
▁i mp
▁im p
▁ imp
eg o
e go
▁o d
▁ od
▁re ce
▁rec e
▁ rece
mi t
m it
ff ic
f fic
stack overflow
ie ve
iev e
▁ З
▁n ov
▁no v
▁ nov
ц е
▁In tern
▁Int ern
▁Inter n
▁ Intern
b u
▁s ugg
▁su gg
▁sug g
▁l oop
▁lo op
▁ loop
ri de
rid e
r ide
▁$ (
▁ $(
▁s uper
▁su per
▁sup er
▁ super
ri d
r id
ны х
н ых
▁P er
▁Pe r
▁ Per
▁d om
▁do m
▁ dom
= '
ut sch
uts ch
le n
l en
▁w rite
▁writ e
▁wr ite
▁ write
▁in v
▁ inv
ou th
out h
o uth
▁H er
▁He r
▁ Her
▁y ears
▁year s
▁ye ars
▁or iginal
▁orig inal
▁origin al
▁ original
eg a
e ga
▁S te
▁St e
▁ Ste
▁se ems
▁see ms
▁seem s
é g
▁n ext
▁ne xt
▁ next
ed er
ede r
e der
▁N e
▁ Ne
av as
ava s
a vas
ific ation
ifi cation
ifica tion
Ex ception
▁D er
▁De r
▁ Der
▁v e
▁ ve
at ic
ati c
ha t
h at
br ary
bra ry
re turn
ret urn
ur ch
is ion
isi on
m i
oi nt
oin t
o int
▁d ay
▁da y
▁ day
ic tion
ict ion
i ction
á l
▁é s
▁ és
▁th ough
▁thou gh
▁ though
ac tion
act ion
a ction
í t
un gen
ung en
unge n
ou rs
our s
o urs
▁s cript
▁scr ipt
▁scri pt
▁ script
▁in formation
▁inform ation
▁ information
▁mult i
▁mul ti
▁ multi
▁\ \
▁ \\
st er
ste r
s ter
к е
A C
ci es
cie s
c ies
▁dis play
▁disp lay
▁ display
om an
oma n
o man
Tim e
T ime
iu s
i us
)) ;
) );
tr e
t re
▁l im
▁li m
▁ lim
at ely
ate ly
atel y
é d
is te
ist e
i ste
▁с а
▁ са
pos t
po st
p ost
ue l
u el
im g
▁ ч
ск а
с ка
el d
e ld
pp er
ppe r
p per
ul a
u la
▁gener al
▁gen eral
▁gene ral
▁ general
A l
For m
F orm
▁u pon
▁up on
z o
am ente
ament e
amen te
a mente
▁p rom
▁pro m
▁pr om
▁ prom
▁ ü
le x
l ex
▁t urn
▁tu rn
▁tur n
▁ turn
▁м е
▁ ме
en tion
ent ion
enti on
ле н
л ен
▁a f
▁ af
ic le
i cle
ст в
с тв
▁F il
▁ Fil
▁ Ф
ava script
avas cript
Ma n
M an
ar a
a ra
wa re
war e
w are
al ign
ali gn
an gle
ang le
▁S c
▁ Sc
un ic
uni c
u nic
▁f ran
▁fr an
▁fra n
▁ fran
U n
z i
me t
m et
Ad d
A dd
▁p ub
▁pu b
▁ pub
ко в
к ов
▁g en
▁ge n
▁ gen
▁p od
▁po d
▁ pod
▁s um
▁su m
▁ sum
▁h aving
▁ha ving
▁hav ing
▁a vec
▁av ec
▁ave c
s l
▁f ig
▁fi g
▁ fig
▁R es
▁Re s
▁ Res
Dat e
Da te
D ate
ul es
ule s
u les
wi th
w ith
ски й
с кий
g u
E T
▁b ro
▁br o
▁ bro
ri e
r ie
ap s
a ps
en ding
end ing
endi ng
ma il
mai l
m ail
oo k
o ok
▁su ccess
▁succ ess
▁suc cess
▁ success
ber g
be rg
b erg
▁d eb
▁de b
▁ deb
el ta
elt a
() `
( )`
ent ial
enti al
fr ame
fra me
fram e
f rame
Ke y
K ey
in n
i nn
▁sim ple
▁simp le
▁simpl e
▁ simple
iv al
iva l
i val
▁c are
▁car e
▁ca re
▁ care
▁W eb
▁We b
▁ Web
") .
" ).
>< /
> </
▁d atabase
▁data base
▁dat abase
▁datab ase
▁ database
▁N ow
▁No w
▁ Now
In d
I nd
▁м о
▁ мо
ch t
c ht
ba n
b an
ra m
r am
equ ation
sk i
s ki
ie f
i ef
li m
l im
Ge t
G et
▁t re
▁tr e
▁ tre
at en
ate n
a ten
be d
b ed
▁J e
▁ Je
▁result s
▁ results
л ю
те ль
тел ь
т ель
d b
▁b it
▁bi t
▁ bit
bo dy
b ody
Ar ray
Arr ay
m u
pr ession
press ion
p ression
▁с та
▁ст а
▁ ста
on y
o ny
if f
i ff
▁b ar
▁ba r
▁ bar
▁Ar ch
▁Arc h
▁ Arch
ber s
be rs
b ers
) {
▁M on
▁Mo n
▁ Mon
▁do ing
▁doi ng
▁pro f
▁pr of
▁ prof
▁inst all
▁instal l
▁ install
▁p osition
▁pos ition
▁posit ion
▁ position
em a
e ma
▁} );
▁}) ;
▁ });
Pat h
Pa th
P ath
al i
a li
▁& &
▁ &&
le v
l ev
▁c annot
▁can not
▁M ay
▁Ma y
▁ May
in st
ins t
- \
▁c oun
▁co un
▁cou n
▁a ng
▁an g
▁ ang
▁app ear
▁appe ar
co r
c or
ci ó
c ió
id ed
ide d
i ded
qu estions
quest ions
question s
at ter
att er
atte r
▁P a
▁ Pa
se lect
sel ect
s elect
▁pr inci
▁prin ci
E vent
▁s ide
▁si de
▁sid e
▁ side
▁m em
▁me m
▁ mem
▁J an
▁Ja n
▁ Jan
ar io
ari o
a rio
▁with in
▁wit hin
▁V al
▁Va l
▁ Val
ode s
od es
o des
idd le
ur ation
ura tion
br a
b ra
▁d ate
▁da te
▁dat e
▁ date
[ ]
▁en tre
▁ent re
▁entr e
▁ entre
il i
i li
Port ail
doc s
do cs
d ocs
ско й
с кой
El ement
E lement
▁m essage
▁mess age
▁ message
▁n ach
▁na ch
▁nac h
▁ nach
▁d uring
▁du ring
▁dur ing
▁g ra
▁gr a
▁ gra
et work
▁B y
▁ By
▁t ell
▁te ll
▁tel l
et e
e te
~ \
▁b is
▁bi s
▁ bis
▁p u
▁ pu
▁re d
▁r ed
▁ red
▁t hing
▁th ing
▁thin g
▁ thing
▁s ort
▁so rt
▁sor t
▁ sort
xi m
x im
ir es
ire s
i res
Use r
Us er
U ser
io d
i od
▁E st
▁Es t
▁ Est
os ed
ose d
o sed
ou te
out e
o ute
▁L es
▁Le s
▁ Les
▁s ent
▁se nt
▁sen t
▁ sent
rib ute
ribu te
ut es
ute s
u tes
ist ory
istor y
isto ry
i story
▁ser vice
▁serv ice
▁servi ce
▁ service
' ;
fi eld
f ield
▁I N
▁ IN
ens ion
re l
r el
▁go ing
▁ going
we b
w eb
Con text
Cont ext
▁l ater
▁la ter
▁lat er
▁late r
u k
lay out
l ayout
on a
o na
á t
---- ------------
-------- --------
------------ ----
------ ----------
---------- ------
▁ex act
an dom
and om
ando m
▁s ie
▁si e
I I
▁The y
▁Th ey
▁ They
ment e
men te
m ente
ib li
▁f ine
▁fin e
▁fi ne
U T
▁de velop
▁deve lop
▁ develop
▁E in
so ft
of f
o ff
Se t
S et
▁a z
▁ az
et ers
eter s
ete rs
e ters
il der
ild er
ilde r
i lder
ple s
pl es
p les
▁spec ific
▁ specific
▁o m
▁ om
er ror
err or
e rror
ent ly
▁fil m
▁fi lm
▁ film
uc k
u ck
ain s
ai ns
a ins
ac ión
ació n
aci ón
a ción
ge s
g es
ж а
▁th ings
▁thing s
▁thin gs
S h
▁th ought
▁though t
▁ad ded
▁add ed
▁ added
de p
d ep
ско го
ск ого
ског о
с кого
▁L i
▁ Li
il s
i ls
yn c
y nc
▁т о
▁ то
ri es
rie s
r ies
▁c u
▁ cu
ch en
che n
c hen
IO N
I ON
▁D es
▁De s
▁ Des
ult ado
ir t
i rt
▁b ased
▁bas ed
▁base d
▁ba sed
▁ based
▁m o
▁ mo
▁d est
▁de st
▁des t
▁ dest
pn g
p ng
re en
ree n
r een
▁r unning
▁run ning
▁ running
am ma
amm a
ou d
o ud
▁re fer
▁ref er
▁ refer
io us
i ous
▁J ul
▁Ju l
▁ Jul
▁s earch
▁se arch
▁ search
al d
a ld
ed e
e de
▁w rong
▁wr ong
A n
▁u ntil
▁un til
▁ until
si te
s ite
ay er
aye r
a yer
▁on ce
▁ once
ar r
a rr
▁again st
== ==
=== =
= ===
▁s ource
▁ source
ar n
a rn
ap i
a pi
▁re present
▁repr esent
▁repres ent
▁repre sent
▁a ff
▁af f
▁ aff
▁s ein
▁se in
▁sei n
▁ sein
▁al low
▁all ow
▁allo w
▁ allow
or mal
orm al
en ded
end ed
ende d
▁cont rol
▁contr ol
▁contro l
▁ control
math bf
com e
co me
c ome
cu r
c ur
en do
end o
w a
▁up date
▁upd ate
▁ update
▁in side
▁ins ide
▁ inside
▁re ason
▁ reason
om en
ome n
o men
▁в ы
▁ вы
D e
▁ј е
▁ је
s w
▁s ever
▁se ver
O f
▁inst ance
▁ instance
▁m er
▁me r
▁ mer
▁e ffect
▁eff ect
▁ effect
col or
co lor
colo r
ug ust
il t
i lt
de s
d es
it z
i tz
ul ation
ula tion
u lation
ni e
n ie
▁W orld
▁Wor ld
▁ World
▁sim ilar
▁ similar
ym bol
hi ng
hin g
h ing
▁m ark
▁mar k
▁ mark
St ate
Stat e
▁cont ent
▁conten t
▁conte nt
▁ content
▁me ans
▁mean s
am ed
ame d
a med
▁E nd
▁En d
▁ End
N D
co unt
cou nt
c ount
▁In st
▁Ins t
▁ Inst
per ty
pert y
ct or
c tor
▁{ \
▁ {\
▁L et
▁Le t
▁ Let
▁! =
▁ !=
▁get ting
▁ getting
ut h
u th
um ber
umb er
▁Cons ultado
sch aft
sc haft
le te
let e
l ete
▁W ill
▁Wil l
▁Wi ll
▁ Will
▁E m
▁ Em
he ad
h ead
▁l eg
▁le g
▁ leg
но м
н ом
O r
ar m
a rm
pon d
po nd
p ond
▁Ch rist
▁Chris t
▁Chr ist
▁ Christ
▁a round
▁ar ound
▁ around
▁c lear
▁cl ear
▁cle ar
▁ clear
▁h ref
▁hr ef
▁ href
▁S ee
▁Se e
▁ See
') .
' ).
▁cre ated
▁create d
▁ created
▁b utton
▁but ton
▁ button
in ing
ini ng
i ning
▁c lick
▁cl ick
▁cli ck
▁ click
ia m
i am
pl it
p lit
F or
▁p olit
▁po lit
▁pol it
▁ polit
▁se em
▁see m
▁l ife
▁li fe
▁lif e
▁ life
но в
н ов
▁in tern
▁int ern
▁inter n
▁inte rn
▁ intern
щ и
se l
s el
so ci
s oci
▁s tor
▁st or
▁sto r
▁ stor
cl e
c le
ear ch
e arch
and roid
andro id
andr oid
}^ {
} ^{
▁e ither
▁f ew
▁fe w
▁init ial
▁initi al
▁ initial
l ength
ri a
r ia
sq l
s ql
wi k
w ik
▁é t
▁ ét
ue r
u er
▁val id
▁ valid
An d
A nd
in clude
includ e
ur y
u ry
▁s us
▁su s
ir ed
ire d
i red
▁A fter
▁Af ter
▁ After
▁d ue
▁du e
▁ due
▁b ei
▁be i
▁ bei
our ces
ource s
▁N ov
▁No v
▁ Nov
Ac t
A ct
▁C ont
▁Con t
▁Co nt
▁ Cont
▁bre ak
▁ break
es ted
est ed
este d
e sted
▁act ually
▁actual ly
▁actu ally
el se
els e
tm l
t ml
re r
r er
on es
one s
o nes
▁de sign
▁des ign
▁ design
▁pro perty
▁proper ty
▁ property
ph i
p hi
al ity
ali ty
oc h
o ch
is ts
ist s
▁ ·
ud io
udi o
A B
al a
a la
ion es
io nes
ione s
i ones
ф и
fin d
fi nd
f ind
A s
▁c ustom
▁cust om
▁ custom
▁a nn
▁an n
▁ ann
E S
O T
l ambda
▁i dent
▁id ent
▁ide nt
▁ ident
▁or gan
▁org an
▁ organ
▁C ent
▁Ce nt
▁ Cent
▁C har
▁Ch ar
▁Cha r
▁ Char
▁o s
▁ os
▁h ard
▁ha rd
▁har d
▁ hard
ро в
р ов
▁/ >
▁ />
k o
▁ex per
▁exp er
▁se par
▁sep ar
▁ separ
y l
ou rn
our n
o urn
▁d ev
▁de v
▁ dev
▁a uch
▁au ch
▁auc h
▁ auch
▁b lock
▁bl ock
▁blo ck
▁ block
bo ok
b ook
▁m ap
▁ma p
▁ map
il la
ill a
i lla
▁com put
▁comp ut
▁ comput
▁s pace
▁sp ace
▁spac e
▁ space
res ult
) }
▁e cho
▁ec ho
▁ echo
con fig
conf ig
h i
▁lar ge
▁larg e
▁ large
▁w idth
▁wid th
▁ width
▁G o
▁ Go
ma t
m at
▁d iff
▁di ff
▁dif f
▁ diff
▁k ind
▁ki nd
▁kin d
▁ kind
an ces
ance s
anc es
yn am
yna m
y nam
▁col or
▁co lor
▁ color
In t
I nt
so l
s ol
▁p i
▁ pi
▁char acter
▁charact er
▁ character
om ent
ome nt
omen t
o ment
▁res ponse
▁respons e
▁ response
ig ma
ward s
war ds
w ards
ar row
arr ow
с у
ti es
t ies
▁ü ber
▁ über
Im age
y d
▁п ере
▁пер е
▁пе ре
▁ пере
▁n ode
▁no de
▁nod e
▁ node
▁it em
▁i tem
▁ item
ach ine
achi ne
im a
i ma
▁v a
▁ va
▁appro ach
▁w er
▁we r
▁ wer
▁ч е
▁ че
O n
ol low
oll ow
он а
о на
ct ed
c ted
ur ed
ure d
u red
Cont roller
Control ler
li ed
lie d
l ied
▁j o
▁ jo
▁d al
▁da l
▁ dal
un k
▁ î
st art
sta rt
star t
ol a
o la
▁com pon
▁comp on
I C
bi t
b it
▁b ase
▁bas e
▁ba se
▁ base
п у
▁id ea
▁ide a
▁ idea
▁d ire
▁di re
▁dir e
▁ dire
▁r ad
▁ra d
▁ rad
gr oup
gro up
▁W ith
▁Wi th
▁Wit h
▁ With
ser ver
serv er
serve r
si de
s ide
si ng
sin g
s ing
▁d ies
▁di es
▁die s
▁n ear
▁ne ar
▁ near
▁v oor
▁vo or
▁ voor
▁arg ument
▁ argument
▁} ,
▁ },
▁l and
▁la nd
▁lan d
▁ land
▁n ames
▁name s
▁na mes
▁nam es
▁ names
▁o ption
▁op tion
▁opt ion
▁ option
ith ub
pp ed
ppe d
p ped
au g
a ug
▁l inks
▁link s
▁lin ks
▁ links
▁f ull
▁fu ll
▁ful l
▁ full
▁s itu
▁si tu
▁sit u
▁con sole
▁cons ole
▁ console
▁e tc
▁et c
▁ etc
au x
a ux
▁C or
▁Co r
▁ Cor
icro soft
▁c ame
▁cam e
▁ca me
lo cal
loc al
l ocal
▁k nown
▁kn own
▁know n
▁ known
▁multi ple
▁multip le
▁ multiple
angu age
▁t otal
▁to tal
▁tot al
▁ total
ol ogy
olog y
olo gy
ä t
▁ Х
▁f re
▁fr e
▁ fre
▁t en
▁te n
▁ ten
ide o
▁b es
▁be s
▁ bes
tr ue
Qu ery
Que ry
om m
o mm
▁A rt
▁Ar t
▁ Art
▁ke ep
▁ keep
▁Un iversity
▁Univers ity
re ate
rea te
pp ort
ppo rt
p port
▁p ython
▁ python
tr a
t ra
ect or
ec tor
e ctor
р і
op h
o ph
▁c onc
▁con c
▁co nc
▁f our
▁fo ur
▁fou r
▁ four
vi ron
vir on
▁v ia
▁vi a
▁ via
? "
im age
ima ge
ol l
o ll
ны е
н ые
▁con text
▁cont ext
▁conte xt
▁ context
▁s em
▁se m
▁ sem
. _
▁e ng
▁en g
▁ eng
ma r
m ar
A D
▁m or
▁mo r
▁ mor
▁C al
▁Ca l
▁ Cal
▁c ell
▁ce ll
▁cel l
▁ cell
im al
ima l
i mal
AT E
A TE
▁in f
▁ inf
ö n
uf fer
uff er
s q
.. ..
... .
. ...
▁z ur
▁zu r
W ith
ра н
р ан
ch n
c hn
▁d oor
▁do or
▁ door
cont ent
▁m iss
▁mi ss
▁mis s
▁ miss
▁s imp
▁sim p
▁si mp
▁ simp
á r
ir a
i ra
▁h at
▁ha t
▁ hat
Te st
T est
▁c ertain
▁cert ain
▁cer tain
▁ certain
N S
▁c ho
▁ch o
▁ cho
▁ad v
▁ adv
wh ere
w here
▁lo oking
▁look ing
▁ looking
▁t imes
▁time s
▁tim es
▁ti mes
▁ times
ни х
н их
ut o
u to
▁ É
ca n
c an
ho st
hos t
h ost
▁( *
▁ (*
lo at
▁n icht
▁ni cht
▁nic ht
▁nich t
Fi eld
F ield
bu rg
bur g
b urg
con st
cons t
ad es
ade s
a des
▁M us
▁Mu s
▁ Mus
▁n othing
▁not hing
▁no thing
▁ nothing
▁in cre
▁inc re
▁M in
▁Mi n
▁ Min
▁p ower
▁po wer
▁pow er
▁ power
▁Amer ican
▁America n
▁ American
l n
val id
un gs
ung s
▁N ational
▁Nat ional
▁Nation al
▁ National
▁S an
▁Sa n
▁ San
▁Y ork
Re quest
ch ar
cha r
c har
▁Z e
▁ Ze
but ton
b utton
▁a lg
▁al g
▁ alg
SO N
S ON
▁a p
▁ ap
uf f
u ff
ab ility
abil ity
е м
▁any thing
el a
e la
() )
( ))
б а
amp ion
ampio n
▁p ot
▁po t
▁ pot
▁f ut
▁fu t
ail able
▁p rop
▁pro p
▁pr op
▁ prop
" ]
▁l ess
▁le ss
▁les s
▁ less
la g
l ag
▁A ugust
▁Aug ust
▁ August
I t
▁p lease
▁ple ase
▁st yle
▁sty le
▁ style
▁Al so
▁Als o
▁ Also
b t
▁pro bably
▁prob ably
▁O ne
▁On e
▁ One
▁p oss
▁po ss
▁pos s
▁ poss
U I
ui t
u it
▁W est
▁We st
▁Wes t
▁ West
h n
+ \
But ton
Butt on
B utton
js on
j son
er r
e rr
ra me
ram e
r ame
do m
d om
il on
ilo n
i lon
al f
▁c lient
▁cl ient
▁cli ent
▁ client
▁cont inu
▁contin u
▁ continu
x ml
pe c
p ec
ad or
ado r
a dor
l s
▁how ever
▁A ny
▁An y
▁ Any
än d
ä nd
math rm
▁u rl
▁ur l
▁ url
▁b ook
▁bo ok
▁ book
▁g l
▁ gl
iv es
ive s
i ves
g i
▁t ro
▁tr o
▁U S
▁ US
po int
p oint
op en
ope n
o pen
▁c ur
▁cu r
▁ cur
▁e ra
▁er a
▁ era
▁part icular
▁partic ular
▁particul ar
▁parti cular
▁H T
▁ HT
oo t
o ot
el lo
ell o
lo bal
lob al
▁a ction
▁act ion
▁ac tion
▁ action
▁I nt
▁In t
▁ Int
▁in clude
▁incl ude
▁includ e
▁inclu de
▁ include
▁el ements
▁element s
▁ele ments
▁elem ents
▁ elements
на я
ar ds
ard s
▁B l
▁ Bl
▁h um
▁hu m
▁ hum
fr om
f rom
ch ange
chan ge
▁function s
▁fun ctions
▁ functions
he n
h en
Ser vice
Serv ice
▁he ight
▁ height
▁L and
▁La nd
▁Lan d
▁ Land
ia s
i as
g s
ió n
i ón
ло в
л ов
no de
n ode
. ”
ha nd
han d
h and
▁б у
▁ бу
▁a mb
▁am b
▁ amb
▁L u
▁ Lu
▁th row
▁thr ow
▁thro w
▁ throw
▁m ot
▁mo t
▁ mot
▁A ct
▁Ac t
▁ Act
▁w orld
▁wor ld
▁ world
_ \
ba se
bas e
b ase
▁C o
▁ Co
▁ar ch
▁arc h
▁ arch
▁## ##
▁### #
▁ ####
ge d
g ed
pr il
p ril
ol der
old er
o lder
Mod el
Mode l
Mo del
M odel
▁sever al
li e
l ie
che ck
c heck
] {
con s
co ns
c ons
▁T ra
▁Tr a
▁ Tra
he ck
▁l east
▁le ast
do wn
d own
eb ru
e bru
De f
D ef
par am
pa ram
para m
p aram
is cher
isch er
ische r
isc her
i scher
▁c as
▁ca s
▁ cas
C H
▁add ress
▁addr ess
▁ address
▁ра з
▁ раз
uf en
ufe n
u fen
ur ope
uro pe
urop e
е й
▁b ound
▁bo und
▁bou nd
▁ bound
C O
▁A ng
▁An g
▁ Ang
▁M a
▁ Ma
In dex
Ind ex
co re
cor e
c ore
ou ch
ouc h
o uch
at abase
ata base
rib ution
ribu tion
doc ument
d ocument
L e
}_ {
} _{
ve rn
ver n
v ern
▁stat ement
▁state ment
▁ statement
▁B rit
▁Br it
on o
o no
ps ilon
psi lon
▁le vel
▁lev el
▁ level
▁pro duct
▁produ ct
▁prod uct
▁ product
I S
▁c ourse
▁cour se
▁cours e
▁ course
▁M r
▁ Mr
> 
▁back ground
▁ background
▁re t
▁r et
▁ ret
er ing
eri ng
e ring
mo st
mos t
m ost
сь ко
ськ о
▁th read
▁thr ead
▁thre ad
▁ thread
it ional
ition al
iti onal
it es
ite s
i tes
P l
▁d os
▁do s
g a
da y
d ay
▁G ener
▁Ge ner
▁Gen er
▁Gene r
▁ Gener
▁t w
▁ tw
A d
"> <
" ><
▁( $
▁ ($
▁m oment
▁mo ment
▁mom ent
tit le
t itle
cre ate
c reate
vers ion
v ersion
Man ager
▁f ur
▁fu r
▁ fur
pp ing
ppi ng
p ping
ij n
о с
▁r ather
▁ra ther
▁rat her
pt ember
O S
▁s ite
▁si te
▁sit e
▁ site
▁c aus
▁ca us
an i
a ni
▁h ome
▁hom e
▁ho me
▁ home
м і
▁sh ort
▁sho rt
▁ short
p a
▁l ead
▁le ad
is hed
ish ed
ci ng
cin g
c ing
or ding
ord ing
ordin g
▁p rote
▁pro te
▁pr ote
▁prot e
▁ prote
с ле
LE CT
L ECT
▁di dn
▁did n
pos ition
p osition
", "
" ,"
() ,
( ),
tr ans
tra ns
▁l ot
▁lo t
▁ lot
▁о д
▁ од
A S
▁s at
▁sa t
▁po ints
▁point s
▁ points
g ithub
st yle
sty le
▁го ду
▁год у
▁D is
▁Di s
▁ Dis
pon ent
om et
ome t
o met
ze r
z er
UL L
U LL
▁p a
▁ pa
A P
ac es
ace s
a ces
▁Un ited
▁Unit ed
am a
a ma
et y
e ty
Col or
Co lor
▁en ough
U S
▁l ength
▁leng th
▁ length
() );
()) ;
( ));
^{ \
^ {\
ft y
f ty
Bo x
B ox
ap ter
apt er
▁comp let
▁comple t
▁compl et
ни к
ma x
m ax
ob ject
obj ect
o bject
( {
img ur
it ive
iti ve
un ch
unc h
▁S ub
▁Su b
▁ Sub
en de
end e
e nde
г у
ateg ory
ategor y
т ы
ia no
ian o
i ano
▁u pd
▁up d
▁A ust
▁Aus t
▁Au st
}{ \
} {\
to p
t op
la s
l as
pi s
p is
in ess
ine ss
ines s
i ness
▁{ 
▁ {
▁ Е
G r
▁A S
▁ AS
▁в е
▁ ве
th ers
ther s
the rs
▁d efined
▁def ined
▁define d
▁defin ed
▁ defined
az ione
azi one
a zione
▁o ffic
▁of fic
▁off ic
▁au tom
▁aut om
▁auto m
▁ autom
ü n
▁b row
▁br ow
▁bro w
▁ brow
▁s erv
▁se rv
▁ser v
▁ serv
▁re move
▁rem ove
▁remov e
▁ remove
ir o
i ro
▁B ibli
▁Bib li
E D
▁w hole
▁wh ole
▁who le
▁ ш
▁J ava
▁Ja va
▁ Java
▁z um
▁zu m
u a
p m
de v
d ev
к ра
ol ds
old s
▁W ar
▁Wa r
ä n
pa ss
pas s
p ass
u z
[ "
▁t ri
▁tr i
▁ tri
is ed
ise d
i sed
х а
▁mem ory
▁memor y
▁ memory
▁P ort
